[
	{"active_sprite": 2, "name": "Villain", "text": "Show me the first one"},
	{"active_sprite": 1, "name": "Minion", "text": "This is a big'n, sir, strong and fearless but with a moral streak. They're being called 'Professor' on account of being regularly seen lecturing villagers on the ills of littering and such like that go against their oaths. That and they're not the sharpest tool in the box. Quests for the rush of combat and the glory of having their story told but dislikes anything complex or subtle."},
	{"active_sprite": 2, "name": "Villain", "text": "Right right, knightly type, all charge and no thinking. There's always at least one"},
	{"active_sprite": 2, "name": "Villain", "text": "You can't be serious. They're carrying a lute into my dungeon?"},
	{"active_sprite": 1, "name": "Minion", "text": "This one is a charmer, sir, easily inspired and always has a plan for getting in with the big wigs but in their own world and easily bored. Supposedly is related to several noble dynasties and was the inspiration for the count de le monteberrello. Quests for drama but dislikes anything not in the moment."},
	{"active_sprite": 2, "name": "Villain", "text": "So a bard too busy swooning to get anything of worth done, terrific"},
	{"active_sprite": 2, "name": "Villain", "text": "Ah, this is more like it"},
	{"active_sprite": 1, "name": "Minion", "text": "This one is a curious one, sir, a genius and a diligent one but can't keep a conversation to one topic and is not travelled. They've mastered the ability to memorise a tome while sleeping and the ability to distinguish ink brands by smell alone. Quests to solve the meti- metefis- metaphysical questions of the universe but dislikes their mundane physical limitations."},
	{"active_sprite": 2, "name": "Villain", "text": "So a spellcaster of practice and expansive reading. I wonder if they'd be impressed by my collection of 8th century dictates…"},
	{"active_sprite": 2, "name": "Villain", "text": "Next. I said next. Wait, this is all you have?"},
	{"active_sprite": 1, "name": "Minion", "text": "This is a mysterioso, sir, careful and subtle but single minded. Rumoured to have been the one that stole the Argent Ruby. Quests for riches but dislikes risk and notoriety."},
	{"active_sprite": 2, "name": "Villain", "text": "Well they will have to do… The Argent Ruby all by themself? I didn't say I was worried, are you worried?!?"},
]
