{
	"TrapRoom": {
		"entry_text": "The delvers have reached the poisoned pit trap! I saw the Bard puke their guts, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have risked the jump and fallen in! Their wounds seep black, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have summoned a magical bridge across! They... are unharmed, sir",
	},
	"CombatRoom": {
		"entry_text": "The delvers have reached the worlf pens! The Thief shivered, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have been sniffed out and ambushed! They've been gnashed ragged, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have dressed as brears and scared the wolves away! They... are unharmed, sir",
	},
	"PuzzleRoom": {
		"entry_text": "The delvers have reached the clockwork crane! The Knight is fuming, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have been forced to climb out without the crane's aid! They look exhausted, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have connected the crane to its lost ancestors! They've been... listed safely out of the roon, sir",
	},
	"SocialRoom": {
		"entry_text": "The delvers have reached the spirit coven's chambers! The Wizard was held back, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have been turned into frogs! (But they got better) they struggle to speak, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have negotiated a truce between the witches due to their shared hatred of laundry! Their backs have been... patted, sir",
	},
	"EnvironmentalRoom": {
		"entry_text": "The delvers have reached the rush blood gorge! The Wizard recoiled from the smell, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have been forced to swim through! They look sickly, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have found our bathing nook and bounced over on a wave of lather! They... are squeaky clean, sir",
	},
	"RichesRoom": {
		"entry_text": "The delvers have reached the hoard of the boar lord! The Knight burst into a lecture, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have been battered by a porcine stampede! Their rations have been scoffed, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have realised the boar lord's truffles are a priceless hair growth potion ingredient! They... have gained renewed bounce and body to their curls, sir",
	},
	"KnowledgeRoom": {
		"entry_text": "The delvers have reached the lint scroll vortex! The Bard was hit with a fit of sneezes, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have accidentally shredded the scrolls! They struggle to breath due to the dust cloud, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have learned the language of infinite pockets by eating a mushroom they found! They... are vibing, sir",
	},
	"HonourRoom": {
		"entry_text": "The delvers have reached the beetle mill! They tore up their map in apparent frustration, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have spent hours arguing with each other! Their equipment is dented from trying failed schemes, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have obtained beetle bread! They have gained the proprotional strength of an insect from eating beetle bread! They... are stuffed, sir",
	},
	"GloryRoom": {
		"entry_text": "The delvers have reached the nest of the ink crows! The Rogue stayed down and heavily critiqued their party-mates",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have lost their best jewels to the crow's pecking! They tore up their side-quest poster, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have entranced the crows with a rainbow scattering lends and rescued the emo kids of Proxim village! They... are considered muses, sir",
	},
	"HealRoom": {
		"entry_text": "The delvers have reached the immortal meadow! They visibly frolic, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "The delvers have fallen victim to the meadow's magical perfume! They struggle to tell dream from reality, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "The delvers have sang with the forget-me-nots and now know the true meaning of life! They... have inspired apostles, sir",
	},
	"start_room": {
		"entry_text": "The delvers have reached a new level, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "There wasn't even a challenge here, I'm not sure how they failed, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "They succeded as finding their way through a one way staircase, sir",
	},
	"end_room": {
		"entry_text": "The delvers have reached the end of the level, sir",
		"base_chance": 0.6,
		"bonuses": ["TRAP"],
		"reward_motivation": 20,
		"reward_bonuses": ["RICHES"],
		"types": "Challenge",
		"fail_text": "They're in pretty bad shape, sir",
		"fail_damage": 50,
		"fail_demotivation": 30,
		"exp": 60,
		"pass_text": "Let's throw a boss at them, sir",
	}
}
